ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM302X/TARGET_ADUCM3029/device/sys/ADuCM302x_device.h
/*!@}*/

/** @defgroup SYS System Identification and Debug Enable (SYS) Module
 *  System Identification and Debug Enable
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_SYS_TypeDef
 *  \brief  System Identification and Debug Enable
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SYS_TypeDef__
typedef struct _ADI_SYS_TypeDef
{
    __I __C  uint8_t  RESERVED0[32];
    __I __C  uint16_t   ADIID;                         /*!< ADI Identification */
    __I __C  uint8_t  RESERVED1[2];
    __I __C  uint16_t   CHIPID;                        /*!< Chip Identifier */
    __I __C  uint8_t  RESERVED2[26];
    __O      uint16_t   SWDEN;                         /*!< Serial Wire Debug Enable */
} ADI_SYS_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SYS_TypeDef__ */

/*!@}*/

/** @defgroup WDT Watchdog Timer (WDT) Module
 *  Watchdog Timer
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_WDT_TypeDef
 *  \brief  Watchdog Timer
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_WDT_TypeDef__
typedef struct _ADI_WDT_TypeDef
{
    __IO     uint16_t   LOAD;                          /*!< Load Value */
    __I __C  uint8_t  RESERVED0[2];
    __I __C  uint16_t   CCNT;                          /*!< Current Count Value */
    __I __C  uint8_t  RESERVED1[2];
    __IO     uint16_t   CTL;                           /*!< Control */
    __I __C  uint8_t  RESERVED2[2];
    __O      uint16_t   RESTART;                       /*!< Clear Interrupt */
    __I __C  uint8_t  RESERVED3[10];
    __I __C  uint16_t   STAT;                          /*!< Status */
} ADI_WDT_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_WDT_TypeDef__ */

/*!@}*/

/** @defgroup I2C I2C Master/Slave (I2C) Module
 *  I2C Master/Slave
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_I2C_TypeDef
 *  \brief  I2C Master/Slave
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_TypeDef__
typedef struct _ADI_I2C_TypeDef
{
    __IO     uint16_t   MCTL;                          /*!< Master Control */
    __I __C  uint8_t  RESERVED0[2];
    __IO     uint16_t   MSTAT;                         /*!< Master Status */
    __I __C  uint8_t  RESERVED1[2];
    __I __C  uint16_t   MRX;                           /*!< Master Receive Data */
    __I __C  uint8_t  RESERVED2[2];
    __IO     uint16_t   MTX;                           /*!< Master Transmit Data */
    __I __C  uint8_t  RESERVED3[2];
    __IO     uint16_t   MRXCNT;                        /*!< Master Receive Data Count */
    __I __C  uint8_t  RESERVED4[2];
    __I __C  uint16_t   MCRXCNT;                       /*!< Master Current Receive Data Count */
    __I __C  uint8_t  RESERVED5[2];
    __IO     uint16_t   ADDR1;                         /*!< Master Address Byte 1 */
    __I __C  uint8_t  RESERVED6[2];
    __IO     uint16_t   ADDR2;                         /*!< Master Address Byte 2 */
    __I __C  uint8_t  RESERVED7[2];
    __IO     uint16_t   BYT;                           /*!< Start Byte */
    __I __C  uint8_t  RESERVED8[2];
    __IO     uint16_t   DIV;                           /*!< Serial Clock Period Divisor */
    __I __C  uint8_t  RESERVED9[2];
    __IO     uint16_t   SCTL;                          /*!< Slave Control */
    __I __C  uint8_t  RESERVED10[2];
    __IO     uint16_t   SSTAT;                         /*!< Slave I2C Status/Error/IRQ */
    __I __C  uint8_t  RESERVED11[2];
    __I __C  uint16_t   SRX;                           /*!< Slave Receive */
    __I __C  uint8_t  RESERVED12[2];
    __IO     uint16_t   STX;                           /*!< Slave Transmit */
    __I __C  uint8_t  RESERVED13[2];
    __IO     uint16_t   ALT;                           /*!< Hardware General Call ID */
    __I __C  uint8_t  RESERVED14[2];
    __IO     uint16_t   ID0;                           /*!< First Slave Address Device ID */
    __I __C  uint8_t  RESERVED15[2];
    __IO     uint16_t   ID1;                           /*!< Second Slave Address Device ID */
    __I __C  uint8_t  RESERVED16[2];
    __IO     uint16_t   ID2;                           /*!< Third Slave Address Device ID */
    __I __C  uint8_t  RESERVED17[2];
    __IO     uint16_t   ID3;                           /*!< Fourth Slave Address Device ID */
    __I __C  uint8_t  RESERVED18[2];
    __IO     uint16_t   STAT;                          /*!< Master and Slave FIFO Status */
    __I __C  uint8_t  RESERVED19[2];
    __O      uint16_t   SHCTL;                         /*!< Shared Control */
    __I __C  uint8_t  RESERVED20[2];
    __IO     uint16_t   TCTL;                          /*!< Timing Control Register */
    __I __C  uint8_t  RESERVED21[2];
    __IO     uint16_t   ASTRETCH_SCL;                  /*!< Automatic Stretch SCL */
} ADI_I2C_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_TypeDef__ */

/*!@}*/

/** @defgroup SPI Serial Peripheral Interface (SPI) Module
 *  Serial Peripheral Interface
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_SPI_TypeDef
 *  \brief  Serial Peripheral Interface
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPI_TypeDef__
typedef struct _ADI_SPI_TypeDef
{
    __IO     uint16_t   STAT;                          /*!< Status */
    __I __C  uint8_t  RESERVED0[2];
    __I __C  uint16_t   RX;                            /*!< Receive */
    __I __C  uint8_t  RESERVED1[2];
    __O      uint16_t   TX;                            /*!< Transmit */
    __I __C  uint8_t  RESERVED2[2];
    __IO     uint16_t   DIV;                           /*!< SPI Baud Rate Selection */
    __I __C  uint8_t  RESERVED3[2];
    __IO     uint16_t   CTL;                           /*!< SPI Configuration 1 */
    __I __C  uint8_t  RESERVED4[2];
    __IO     uint16_t   IEN;                           /*!< SPI Configuration 2 */
    __I __C  uint8_t  RESERVED5[2];
    __IO     uint16_t   CNT;                           /*!< Transfer Byte Count */
    __I __C  uint8_t  RESERVED6[2];
    __IO     uint16_t   DMA;                           /*!< SPI DMA Enable */
    __I __C  uint8_t  RESERVED7[2];
    __I __C  uint16_t   FIFO_STAT;                     /*!< FIFO Status */
    __I __C  uint8_t  RESERVED8[2];
    __IO     uint16_t   RD_CTL;                        /*!< Read Control */
    __I __C  uint8_t  RESERVED9[2];
    __IO     uint16_t   FLOW_CTL;                      /*!< Flow Control */
    __I __C  uint8_t  RESERVED10[2];
    __IO     uint16_t   WAIT_TMR;                      /*!< Wait Timer for Flow Control */
    __I __C  uint8_t  RESERVED11[2];
    __IO     uint16_t   CS_CTL;                        /*!< Chip-Select Control for Multi-slave Connections */
    __I __C  uint8_t  RESERVED12[2];
    __IO     uint16_t   CS_OVERRIDE;                   /*!< Chip-Select Override */
    __I __C  uint8_t  RESERVED13[4];
} ADI_SPI_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPI_TypeDef__ */

